org-content/notes-lecture-EOS1.org
#+title: 400A - EOS (polytropic & ideal gas)
#+author: Mathieu Renzo
#+email: mrenzo@arizona.edu
#+PREVIOUS_PAGE: notes-lecture-HSE.org
#+NEXT_PAGE: notes-lecture-VirTheo.org

*Materials*: Chapter 3 of Onno Pols' lecture notes, Sec. 2.2 and Chapter
5 and 13 of Kippenhahn's book, Sec. 2-4 of Clayton's book.

* Equation of state 1/2
** Summary of where we are

We have introduced now two equations of the stellar structure (*N.B.:*
at the end of the course we'll need 5 to close the system and get a
solvable model), and we know we can write them using the Lagrangian
mass coordinate, that is the mass enclosed in a certain radius, as
independent variable. But to reason conceptually about the problem, we
can stick to writing them as a function of r: the Lagrangian formalism
is important when doing numerical work, but less so for analytic
reasoning, when we can easily switch back and forth between r, m, or
any other variable as independent.

*Mass continuity:*
#+begin_latex
\begin{equation}\label{eq:mass_cont}
\frac{dm}{dr} = 4\pi r^{2}\rho \Leftrightarrow  \frac{dr}{dm} = \frac{1}{4\pi r^{2} \rho}\ \ ,
\end{equation}
#+end_latex
where we implicitly are assuming static equilibrium (\partial_{t} = 0).

*Hydrostatic equilibrium:*
#+begin_latex
\begin{equation}\label{eq:HSE}
\frac{dP}{dr} = -\frac{Gm}{r^{2}}\rho \Leftrightarrow \frac{dP}{dm}=-\frac{Gm}{4\pi r^{4}}\ \ .
\end{equation}
#+end_latex

These two equations express the conservation of mass and momentum,
respectively (*N.B.:* it is often useful to write all equations in the
form of conservation laws to solve them numerically), and have as
variables the function $m \equiv m(r)$ (or equivalently $r\equiv r(m)$), $P$ and
$\rho$. So clearly we cannot yet solve them, we need some relation
between the pressure and the density - a so-called /equation of state/
(EOS).

** General consideration on the EOS
In general, this is a relation between the /local/ value of pressure $P$,
density $\rho$, and temperature $T$, which may also depend on the
composition, that is the ensemble of fraction by mass of elements ($X_{i}$
= mass of $i$-th element/total mass):

#+begin_latex
\begin{equation}\label{eq:general_EOS}
P\equiv P(\rho, T, \{X_{i}\})
\end{equation}
#+end_latex

For a given composition ${X_{i}}$, given two out of three between $P, \rho,
T$, one can obtain the third using the EOS.

The aim of this lecture is to introduce first simple EOS which do not
introduce any other variables (so independent of T), and then go over
a more appropriate EOS which is a good approximation for most stars,
the ideal gas EOS. We will see other EOS (for degenerate or
radiation-dominated gas) in a [[./notes-lecture-EOS2][future lecture]].

