html-content/notes-lecture-EOS1.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-02-01 Sat 20:02 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>400A - EOS (polytropic &amp; ideal gas)</title>
<meta name="author" content="Mathieu Renzo" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="./css/style.css" />
<link rel="stylesheet" href="./fontawesome-free-6.7.2-web/css/all.min.css">
<meta name="keywords" content="Mathieu, Renzo, Mathieu Renzo,
			       stellar evolution, 400A, University of
			       Arizona, Steward Observatory, stars,
			       theoretical astrophysics">
</head>
<body>
<div id="preamble" class="status">
<!-- Preamble -->
<!-- The header -->
<div class="header">

  <!-- The site name -->
  <div class="site-name">
    <a id="top" href="./index.html">Stellar Evolution</a>
  </div>

  <!-- The hamburger -->
  <div class="hamburger">
    <div id="myLinks" class="menu">
      <a href="./index.html">Home</a>
      <a href="./syllabus.html">Syllabus</a>
      <a href="./lectures.html">Lectures</a>
      <a href="./projects.html">Projects</a>
    </div>
    <a href="javascript:void(0);" class="icon" onclick="HamburgerMenuFunction()">
      <i class="fa fa-bars"></i>
    </a>
  </div>

  <div class="navbar">
    <a href="./syllabus.html">Syllabus</a>
    <a href="./lectures.html">Lectures</a>
    <a href="./projects.html">Projects</a>
  </div>
</div>

<!-- scripts -->
<script>
  function HamburgerMenuFunction() {
      var x = document.getElementById("myLinks");
      if (x.style.display === "block") {
	  x.style.display = "none";
      } else {
	  x.style.display = "block";
      }
  }
</script>

<script>
  window.onload = () => {
      const toggleButton = document.getElementById("light-dark-toggle");
      const body = document.body;
      const html = document.documentElement;


      // Check localStorage for user preference
      if (localStorage.getItem("theme") === "dark") {
          body.classList.add("dark-mode");
	  html.classList.toggle("dark-mode");
      }

      // Toggle theme on click
      toggleButton.addEventListener("click", () => {
          body.classList.toggle("dark-mode");
	  html.classList.toggle("dark-mode");

          // Save user preference
          if (body.classList.contains("dark-mode")) {
              localStorage.setItem("theme", "dark");
          } else {
              localStorage.setItem("theme", "light");
          }
      });
  };
</script>
<!-- end scripts-->
</div>
<div id="content" class="content">
<p>
<b>Materials</b>: Chapter 3 of Onno Pols' lecture notes, Sec. 2.2 and Chapter
5 and 13 of Kippenhahn's book, Sec. 2-4 of Clayton's book.
</p>

<div id="outline-container-org8564271" class="outline-2">
<h2 id="org8564271"><a href="#org8564271">Equation of state 1/2</a></h2>
<div class="outline-text-2" id="text-org8564271">
</div>
<div id="outline-container-orgc8dceaf" class="outline-3">
<h3 id="orgc8dceaf"><a href="#orgc8dceaf">Summary of where we are</a></h3>
<div class="outline-text-3" id="text-orgc8dceaf">
<p>
We have introduced now two equations of the stellar structure (<b>N.B.:</b>
at the end of the course we'll need 5 to close the system and get a
solvable model), and we know we can write them using the Lagrangian
mass coordinate, that is the mass enclosed in a certain radius, as
independent variable. But to reason conceptually about the problem, we
can stick to writing them as a function of r: the Lagrangian formalism
is important when doing numerical work, but less so for analytic
reasoning, when we can easily switch back and forth between r, m, or
any other variable as independent.
</p>

<p>
<b>Mass continuity:</b>
</p>
<div class="latex" id="org1a335c3">
\begin{equation}\label{eq:mass_cont}
\frac{dm}{dr} = 4\pi r^{2}\rho \Leftrightarrow  \frac{dr}{dm} = \frac{1}{4\pi r^{2} \rho}\ \ ,
\end{equation}

</div>
<p>
where we implicitly are assuming static equilibrium (&part;<sub>t</sub> = 0).
</p>

<p>
<b>Hydrostatic equilibrium:</b>
</p>
<div class="latex" id="org7112751">
\begin{equation}\label{eq:HSE}
\frac{dP}{dr} = -\frac{Gm}{r^{2}}\rho \Leftrightarrow \frac{dP}{dm}=-\frac{Gm}{4\pi r^{4}}\ \ .
\end{equation}

</div>

<p>
These two equations express the conservation of mass and momentum,
respectively (<b>N.B.:</b> it is often useful to write all equations in the
form of conservation laws to solve them numerically), and have as
variables the function \(m \equiv m(r)\) (or equivalently \(r\equiv r(m)\)), \(P\) and
\(\rho\). So clearly we cannot yet solve them, we need some relation
between the pressure and the density - a so-called <i>equation of state</i>
(EOS).
</p>
</div>
</div>

<div id="outline-container-orgea3e51d" class="outline-3">
<h3 id="orgea3e51d"><a href="#orgea3e51d">General consideration on the EOS</a></h3>
<div class="outline-text-3" id="text-orgea3e51d">
<p>
In general, this is a relation between the <i>local</i> value of pressure \(P\),
density \(\rho\), and temperature \(T\), which may also depend on the
composition, that is the ensemble of fraction by mass of elements (\(X_{i}\)
= mass of $i$-th element/total mass):
</p>

<div class="latex" id="orga844476">
\begin{equation}\label{eq:general_EOS}
P\equiv P(\rho, T, \{X_{i}\})
\end{equation}

</div>

<p>
For a given composition \({X_{i}}\), given two out of three between \(P, \rho,
T\), one can obtain the third using the EOS.
</p>

<p>
The aim of this lecture is to introduce first simple EOS which do not
introduce any other variables (so independent of T), and then go over
a more appropriate EOS which is a good approximation for most stars,
the ideal gas EOS. We will see other EOS (for degenerate or
radiation-dominated gas) in a <a href="./notes-lecture-EOS2">future lecture</a>.
</p>
</div>
</div>
