org-content/notes-lecture-EOS1.org
** Global and local thermal equilibrium
Before we get into the EOS though, we have to ask ourselves whether we
can use thermodynamics/statistical mechanics to describe the
/microscopic/ properties of the stellar gas and find some relationship
between $P$, $\rho$ (and other thermodynamic quantities such as $T$, entropy,
etc). Are these even well defined?

Thermal equilibrium means by definition that all the particles in a
system (including photons, if there is radiation) have the same
temperature $T$, and their velocity distribution are described by a
Maxwell-Boltzmann distribution (for particles) and the black-body
spectrum (for radiation). This situation can only be achieved if there
are sufficient interactions so each particle can exchange energy with
the others (collisions among particles, and scattering/absorption for
photon-particles interactions).

:Questions:
- *Q*: are stars in global thermal equilibrium? If they were, they would
  have a single temperature throughout the star, does this sound
  realistic?
:end:

*Stars are not in global thermal equilibrium*. They are in "/gravothermal
equilibrium/": the hydrostatic equilibrium requirement and the
self-gravity determine the thermal state of each layer so that the
pressure gradient can balance gravity.

However, /locally/, we can still assume that there are stellar layers
with a thickness $dr\ll R$ that are in thermal equilibrium (with $R$ outer
radius of the star, which we have seen to be an idealization, since in
reality $R\equiv R(\lambda)$ depends on the wavelength \lambda at which one observes).
For this to happen, this layer needs still to be much larger than the
mean-free-path for particle-particle and particle-photon interactions.
This allows for many interactions between the particles to occur and
establish /local/ thermal equilibrium within the layer of thickness dr.
Let's consider the mean-free-path for particle-photon interactions first:

#+begin_latex
\begin{equation}
\ell_{\gamma} = \frac{1}{n\sigma} \equiv \frac{1}{\kappa\rho} \ \ ,
\end{equation}
#+end_latex

where n is the number density of particles ([$n$] = cm^{-3}) and \sigma is the
interaction cross section ([\sigma] = cm^{2}), or equivalently, \rho is the mass
density (appearing in the two equations we already have), and \kappa is the
"opacity", which is a way to measure the probability of a photon to
interact with a certain amount of mass.

:Questions:
- *Q*: what are the units of \kappa? How can we interpret it?
:end:

Let's for simplicity assume that a star is all made of hydrogen (a
result first derived \sim100 years ago by Cecilia Payne in her PhD thesis
in 1925). Let's also assume that it is fully ionized (i.e., protons
and electrons are separated from each other). The very minimum opacity
in this case is given by scattering of photons onto the electrons and
is: $\kappa = 0.2(1+X)$ cm^{2} g^{-1} (see also [[./notes-lecture-kappa.org][lecture on opacities]]), where $X$
is the mass fraction hydrogen, so for our rough approximation, \kappa\simeq0.4.
The average density of the Sun is \rho_{\odot, avg}\simeq1.4 g cm^{-3},
therefore \ell_{\gamma} \simeq 2 cm. The mean-free-path for
particle-particle interactions $\ell_\mathrm{b}$ is much smaller (because
the cross section \sigma is larger): the interaction is electromagnetic and
has infinite range, in principle all charged particles feel all other
(we will return on this at the end of this lecture). Therefore, we can
conservatively ask what is the temperature variation across \ell_{\gamma}:

#+begin_latex
\begin{equation}
\Delta T \simeq \ell_{\gamma} \frac{dT}{dr} \le \ell_{\gamma} \frac{T_\mathrm{center} - T_\mathrm{surface}}{R} \simeq \ell_{\gamma} \frac{T_\mathrm{center}}{R}
\end{equation}
#+end_latex

(where we neglect $T_\mathrm{surface}$ because we expect it much lower
than $T_\mathrm${center}$, since we already know $P_\mathrm{center} \gg
P_\mathrm{surface}$). For the Sun we will see that we can estimate
$T_\mathrm{center}\simeq 10^{7}$ K, and we know $R_{\odot}\simeq 10^{11}$ cm, so
$\Delta T\simeq 10^{-4} K \ll T_{surf} \ll T_{center}$.

Thus, we can define layers of the star with $\ell_\mathrm{b} \ll \ell_{\gamma}
\ll dr \ll R$ where locally the temperature variation across the layer is
negligible, and the assumption of /local thermal equilibrium/ (LTE)
holds well. (*N.B.:* you can revise this a posteriori once we have an
EOS and a way to estimate of $T_\mathrm{center}$!)

This may not be true close to the surface, where \ell_{\gamma} progressively
increases (because \rho decreases). There we may need to care about the
wavelength (or frequency) dependence of the cross section \sigma\equiv\sigma(\lambda)
and thus the mean free path: a star has a different "surface" for
different photon frequencies! In those layers, the assumption of LTE
does not work.

As long as we discuss regions of the star with a thickness large
w.r.t. \ell_{\gamma} but small enough that the T variation across them are
negligible, we can use thermodynamics!

Also, as we have seen before, the stars are usually in equilibrium and
change very slowly. Any /local/ thermal imbalance will be restored on
the /local/ thermal timescale, which can be estimate in multiple ways,
but it is usually very short compared to the star evolutionary
timescale (we will see this in more detail later). Thus the assumption
of LTE holds locally (as the "L" indicates) at any time! Therefore,
while we cannot really define a physically meaningful $T$ for the
entire star (beyond some rough averaged quantity), we can meaningfully
define a /local/ $T(r)$ or $T(m)$ temperature that characterizes the gas
/and/ the radiation at that radius/mass coordinate. The local validity
of the LTE assumption allows us to define thermodynamic quantities
from statistical mechanics and look for a relation between them, that
is an EOS.

