html-content/notes-lecture-EOS1.html

<div id="outline-container-orgcb7f4d0" class="outline-3">
<h3 id="orgcb7f4d0"><a href="#orgcb7f4d0">Global and local thermal equilibrium</a></h3>
<div class="outline-text-3" id="text-orgcb7f4d0">
<p>
Before we get into the EOS though, we have to ask ourselves whether we
can use thermodynamics/statistical mechanics to describe the
<i>microscopic</i> properties of the stellar gas and find some relationship
between \(P\), \(\rho\) (and other thermodynamic quantities such as \(T\), entropy,
etc). Are these even well defined?
</p>

<p>
Thermal equilibrium means by definition that all the particles in a
system (including photons, if there is radiation) have the same
temperature \(T\), and their velocity distribution are described by a
Maxwell-Boltzmann distribution (for particles) and the black-body
spectrum (for radiation). This situation can only be achieved if there
are sufficient interactions so each particle can exchange energy with
the others (collisions among particles, and scattering/absorption for
photon-particles interactions).
</p>

<ul class="org-ul">
<li><b>Q</b>: are stars in global thermal equilibrium? If they were, they would
have a single temperature throughout the star, does this sound
realistic?</li>
</ul>

<p>
<b>Stars are not in global thermal equilibrium</b>. They are in "<i>gravothermal
equilibrium</i>": the hydrostatic equilibrium requirement and the
self-gravity determine the thermal state of each layer so that the
pressure gradient can balance gravity.
</p>

<p>
However, <i>locally</i>, we can still assume that there are stellar layers
with a thickness \(dr\ll R\) that are in thermal equilibrium (with \(R\) outer
radius of the star, which we have seen to be an idealization, since in
reality \(R\equiv R(\lambda)\) depends on the wavelength &lambda; at which one observes).
For this to happen, this layer needs still to be much larger than the
mean-free-path for particle-particle and particle-photon interactions.
This allows for many interactions between the particles to occur and
establish <i>local</i> thermal equilibrium within the layer of thickness dr.
Let's consider the mean-free-path for particle-photon interactions first:
</p>

<div class="latex" id="org6b6a859">
\begin{equation}
\ell_{\gamma} = \frac{1}{n\sigma} \equiv \frac{1}{\kappa\rho} \ \ ,
\end{equation}

</div>

<p>
where n is the number density of particles ([\(n\)] = cm<sup>-3</sup>) and &sigma; is the
interaction cross section ([&sigma;] = cm<sup>2</sup>), or equivalently, &rho; is the mass
density (appearing in the two equations we already have), and &kappa; is the
"opacity", which is a way to measure the probability of a photon to
interact with a certain amount of mass.
</p>

<ul class="org-ul">
<li><b>Q</b>: what are the units of &kappa;? How can we interpret it?</li>
</ul>

<p>
Let's for simplicity assume that a star is all made of hydrogen (a
result first derived &sim;100 years ago by Cecilia Payne in her PhD thesis
in 1925). Let's also assume that it is fully ionized (i.e., protons
and electrons are separated from each other). The very minimum opacity
in this case is given by scattering of photons onto the electrons and
is: \(\kappa = 0.2(1+X)\) cm<sup>2</sup> g<sup>-1</sup> (see also <a href="./notes-lecture-kappa.html">lecture on opacities</a>), where \(X\)
is the mass fraction hydrogen, so for our rough approximation, &kappa;&cong;0.4.
The average density of the Sun is &rho;<sub>☉, avg</sub>&cong;1.4 g cm<sup>-3</sup>,
therefore &ell;<sub>&gamma;</sub> &cong; 2 cm. The mean-free-path for
particle-particle interactions \(\ell_\mathrm{b}\) is much smaller (because
the cross section &sigma; is larger): the interaction is electromagnetic and
has infinite range, in principle all charged particles feel all other
(we will return on this at the end of this lecture). Therefore, we can
conservatively ask what is the temperature variation across &ell;<sub>&gamma;</sub>:
</p>

<div class="latex" id="org1bf6c14">
\begin{equation}
\Delta T \simeq \ell_{\gamma} \frac{dT}{dr} \le \ell_{\gamma} \frac{T_\mathrm{center} - T_\mathrm{surface}}{R} \simeq \ell_{\gamma} \frac{T_\mathrm{center}}{R}
\end{equation}

</div>

<p>
(where we neglect \(T_\mathrm{surface}\) because we expect it much lower
than \(T_{center}\), since we already know \(P_{center} \gg P_{surface}\)). For the Sun
we will see that we can estimate \(T_\mathrm{center}\simeq 10^{7}\) K, and we know
\(R_{☉}\simeq 10^{11}\) cm, so \(\Delta T\simeq 10^{-4} K \ll T_{surf} \ll T_{center}\).
</p>

<p>
Thus, we can define layers of the star with \(\ell_\mathrm{b} \ll \ell_{\gamma}
\ll dr \ll R\) where locally the temperature variation across the layer is
negligible, and the assumption of <i>local thermal equilibrium</i> (LTE)
holds well. (<b>N.B.:</b> you can revise this a posteriori once we have an
EOS and a way to estimate of \(T_\mathrm{center}\)!)
</p>

<p>
This may not be true close to the surface, where &ell;<sub>&gamma;</sub> progressively
increases (because &rho; decreases). There we may need to care about the
wavelength (or frequency) dependence of the cross section &sigma;&equiv;&sigma;(&lambda;)
and thus the mean free path: a star has a different "surface" for
different photon frequencies! In those layers, the assumption of LTE
does not work.
</p>

<p>
As long as we discuss regions of the star with a thickness large
w.r.t. &ell;<sub>&gamma;</sub> but small enough that the T variation across them are
negligible, we can use thermodynamics!
</p>

<p>
Also, as we have seen before, the stars are usually in equilibrium and
change very slowly. Any <i>local</i> thermal imbalance will be restored on
the <i>local</i> thermal timescale, which can be estimate in multiple ways,
but it is usually very short compared to the star evolutionary
timescale (we will see this in more detail later). Thus the assumption
of LTE holds locally (as the "L" indicates) at any time! Therefore,
while we cannot really define a physically meaningful \(T\) for the
entire star (beyond some rough averaged quantity), we can meaningfully
define a <i>local</i> \(T(r)\) or \(T(m)\) temperature that characterizes the gas
<i>and</i> the radiation at that radius/mass coordinate. The local validity
of the LTE assumption allows us to define thermodynamic quantities
from statistical mechanics and look for a relation between them, that
is an EOS.
</p>
</div>
</div>
