org-content/notes-lecture-EOS1.org
** Polytropic EOS
Polytropic EOS as a special case of /barotropic/ EOS, which are all the
EOSs for which /the density depends only on the pressure and not on
the temperature or composition/: $\rho\equiv\rho(P)$. These have applications
beyond stellar physics (e.g., for atmospheric physics). A polytropic
EOS is thus a barotropic EOS where the $\rho\equiv\rho(P)$ is in the form of a
powerlaw, although usually written (following the general form of Eq.
\ref{eq:general_EOS}):

#+begin_latex
\begin{equation}\label{eq:polytrope}
P = C\rho^{\Gamma} \equiv C\rho^{1+1/n}\ \ ,
\end{equation}
#+end_latex

where C is a constant, and by definition $\Gamma=\partial \ln P /\partial \ln \rho = 1+1/n$.
The form of the EOS in Eq. \ref{eq:polytrope} may seem particularly
artificial, but it is helpful because it does not introduce any new
variable, and thus "closes" (together with Eq. \ref{eq:mass_cont} and
Eq. \ref{eq:HSE}) the system of equations describing a star! This is
the system of equations used to create, for example, analytic stellar
models (e.g., the Lane-Emden equation), which is one of the topics for
the projects. These can be useful to initialize roughly correct
stellar structures in multi-dimensional hydrodynamic codes for
particular applications (e.g., a common envelope evolution
simulation!), but they are usually insufficient for modern stellar
physics application.

More importantly, there are various /physical/ situations (as we will
return on during [[./notes-lecture-EOS2.org][the second lecture on EOSs]]) in which EOS of this form
occur, and are useful to describe real observed stars.

- fully convective stars (see [[./notes-lecture-conv.org][relative lecture]])
- stars supported by quantum mechanical effects such as white dwarfs
  (WDs)

Often, different polytropes in the form of Eq. \ref{eq:polytrope} can
be used for different layers of the stars (piece-wise polytropes) as
useful approximation. In this cases, it is important to ensure the
/continuity/ of $P$ at the points where different polytropes are
stitched together.

:Question:
- *Q*: why do we want $P$ to be a continuous function in stars?
:end:

** Ideal gas
In general, it is not possible to have an EOS independent of $T$
and/or the composition ${X_{i}}$. Let's consider a /perfect gas/, that is a
gas of particles that do interact with each other (otherwise they
could never exchange energy and be in thermal equilibrium!), but such
as that the energy exchanged in the particle-particle interactions is
much small than their kinetic energy (due to their thermal motion)

#+begin_latex
\begin{equation}
\Delta E_\mathrm{interaction} \ll k_{B} T \ \ ,
\end{equation}
#+end_latex

and other than these interaction between particles, they are free to
move (no external potential).

To obtain the pressure of such gas, we need to consider the
distribution in velocity space of these particles. Let's for a moment
consider particles that all have the same mass m, we can then
equivalently consider the distribution in momentum p=mv of the
particles -- this is convenient to generalize later to relativistic
particles, and we will see how to deal with mixtures of gases (each
with particles m_{i}) further down.

Since the particles of the ideal gas move isotropically within their
volume, the momentum distribution of particles is a Maxwell-Boltzmann
distribution. The number of particles with momentum between $p$ and
$p+dp$ is

#+begin_latex
\begin{equation}\label{eq:Maxwellian}
n(p)dp = \frac{n}{(2\pi m k_{B} T)^{3/2}} \exp\left(-\frac{p^{2}}{2mk_{B}T}\right)4\pi p^{2}dp \ \ ,
\end{equation}
#+end_latex

where on the r.h.s., $n$ is the total number density, the prefactor of
the exponential is the normalization constant, and the exponential
comes from assuming a Gaussian distribution of kinetic energies for
each momentum component (you can demonstrate that a Maxwellian
distribution is equivalent to a Gaussian in each direction $p_{x}$, $p_{y}$,
$p_{z}$, by going to spherical-polar coordinates in momentum space, thus
introducing a Jacobian for the change of variables, and integrating
over the $p_{\theta}$, $p_{\varphi}$ components).

From this, we can calculate the pressure of the gas. By definition
this will be isotropic, and so we can imagine to put a "box" with unit
linear size through our gas (the orientation of the walls does not
matter). To determine the gas pressure we want the force exerted by
the gas on the walls. By Newton's third law this is equal to the
change in momentum of each gas particles as they hit the walls. We
will first consider the momentum change for a generic single particle,
and then integrate over the distribution in Eq. \ref{eq:Maxwellian} to
get the whole pressure.

Let's call the imaginary wall the xy plane and assume the collisions
to be elastic (because we are considering an ideal gas, by definition
any exchange of energy is negligible). For a generic particle of the
gas, it will collide with the wall at an angle $\theta \in [0, \pi/2]$ and the
collision will change its momentum from ($p_{x}$, $p_{y}$, $p_{z}$) to ($p_{x}$,
$p_{y}$, $-p_{z}$): only the component perpendicular to the wall changes
sign. Thus

#+begin_latex
\begin{equation}
\Delta p = 2 p \cos(\theta)\  \mathrm{with}\  p=\sqrt{p_{x}^{2} + p_{y}^{2} +p_{z}^{2}}
\end{equation}
#+end_latex

The time between two collisions of a particle on the same wall is

#+begin_latex
\begin{equation}
\Delta t = \frac{2L}{v\cos(\theta)} = \frac{2}{v\cos(\theta)} \ \ ,
\end{equation}
#+end_latex

where we used the $L=1$ assumption. Thus the force exerted on this
imaginary wall of a unit box is $F=\Delta p/\Delta t = vp cos^{2}(\theta)$, dividing
by $L^{2} = 1$ we obtain the contribution to the pressure from one particle
coming from one specific direction \theta (w.r.t. the wall of the box), and
introducing the distribution of particles in angle and momentum we
have


#+begin_latex
\begin{equation}
dP = vp\cos^{2}(\theta)n(\theta,p)d\theta dp \ \ ,
\end{equation}
#+end_latex

But we can assume that the motion of the particles is isotropic
(spherical symmetry), so $n(\theta,p)d\theta = n(p)sin(\theta)d\theta$, and thus

#+begin_latex
\begin{equation}\label{eq:P_statistic}
dP = vp\cos^{2}(\theta)n(p)\sin(\theta)d\theta dp \Rightarrow P = \frac{1}{3}\int_{0}^{+\infty} n(p)p v dp \ \ ,
\end{equation}
#+end_latex
where we integrated over $\theta$. Combining Eq. \ref{eq:P_statistic} with Eq. \ref{eq:Maxwellian} gives the pressure.

*** Non-relativistic, classical gas
Let's consider a non-relativistic gas of classical particles (no
quantum effects). Then $p= mv \Leftrightarrow v=p/m$ (*N.B.:* we are considering an
ideal gas, so each particle is freely moving, no potential of
interaction!). Carrying out the integral above using the
Maxwell-Boltzmann distribution for $n(p)$ and $v=p/m$ gives

#+begin_latex
\begin{equation}
P = n k_{B} T \ \ .
\end{equation}
#+end_latex

