html-content/notes-lecture-EOS1.html

<div id="outline-container-orgda07c2f" class="outline-3">
<h3 id="orgda07c2f"><a href="#orgda07c2f">Polytropic EOS</a></h3>
<div class="outline-text-3" id="text-orgda07c2f">
<p>
Polytropic EOS as a special case of <i>barotropic</i> EOS, which are all the
EOSs for which <i>the density depends only on the pressure and not on
the temperature or composition</i>: \(\rho\equiv\rho(P)\). These have applications
beyond stellar physics (e.g., for atmospheric physics). A polytropic
EOS is thus a barotropic EOS where the \(\rho\equiv\rho(P)\) is in the form of a
powerlaw, although usually written (following the general form of Eq.
\ref{eq:general_EOS}):
</p>

<div class="latex" id="orgca91dfc">
\begin{equation}\label{eq:polytrope}
P = C\rho^{\Gamma} \equiv C\rho^{1+1/n}\ \ ,
\end{equation}

</div>

<p>
where C is a constant, and by definition \(\Gamma=\partial \ln P /\partial \ln \rho = 1+1/n\).
The form of the EOS in Eq. \ref{eq:polytrope} may seem particularly
artificial, but it is helpful because it does not introduce any new
variable, and thus "closes" (together with Eq. \ref{eq:mass_cont} and
Eq. \ref{eq:HSE}) the system of equations describing a star! This is
the system of equations used to create, for example, analytic stellar
models (e.g., the Lane-Emden equation), which is one of the topics for
the projects. These can be useful to initialize roughly correct
stellar structures in multi-dimensional hydrodynamic codes for
particular applications (e.g., a common envelope evolution
simulation!), but they are usually insufficient for modern stellar
physics application.
</p>

<p>
More importantly, there are various <i>physical</i> situations (as we will
return on during <a href="./notes-lecture-EOS2.html">the second lecture on EOSs</a>) in which EOS of this form
occur, and are useful to describe real observed stars.
</p>

<ul class="org-ul">
<li>fully convective stars (see <a href="./notes-lecture-conv.html">relative lecture</a>)</li>
<li>stars supported by quantum mechanical effects such as white dwarfs
(WDs)</li>
</ul>

<p>
Often, different polytropes in the form of Eq. \ref{eq:polytrope} can
be used for different layers of the stars (piece-wise polytropes) as
useful approximation. In this cases, it is important to ensure the
<i>continuity</i> of \(P\) at the points where different polytropes are
stitched together.
</p>

<ul class="org-ul">
<li><b>Q</b>: why do we want \(P\) to be a continuous function in stars?</li>
</ul>
</div>
</div>

<div id="outline-container-org7f7d045" class="outline-3">
<h3 id="org7f7d045"><a href="#org7f7d045">Ideal gas</a></h3>
<div class="outline-text-3" id="text-org7f7d045">
<p>
In general, it is not possible to have an EOS independent of \(T\)
and/or the composition \({X_{i}}\). Let's consider a <i>perfect gas</i>, that is a
gas of particles that do interact with each other (otherwise they
could never exchange energy and be in thermal equilibrium!), but such
as that the energy exchanged in the particle-particle interactions is
much small than their kinetic energy (due to their thermal motion)
</p>

<div class="latex" id="org1b65a0c">
\begin{equation}
\Delta E_\mathrm{interaction} \ll k_{B} T \ \ ,
\end{equation}

</div>

<p>
and other than these interaction between particles, they are free to
move (no external potential).
</p>

<p>
To obtain the pressure of such gas, we need to consider the
distribution in velocity space of these particles. Let's for a moment
consider particles that all have the same mass m, we can then
equivalently consider the distribution in momentum p=mv of the
particles &#x2013; this is convenient to generalize later to relativistic
particles, and we will see how to deal with mixtures of gases (each
with particles m<sub>i</sub>) further down.
</p>

<p>
Since the particles of the ideal gas move isotropically within their
volume, the momentum distribution of particles is a Maxwell-Boltzmann
distribution. The number of particles with momentum between \(p\) and
\(p+dp\) is
</p>

<div class="latex" id="orgd85831b">
\begin{equation}\label{eq:Maxwellian}
n(p)dp = \frac{n}{(2\pi m k_{B} T)^{3/2}} \exp\left(-\frac{p^{2}}{2mk_{B}T}\right)4\pi p^{2}dp \ \ ,
\end{equation}

</div>

<p>
where on the r.h.s., \(n\) is the total number density, the prefactor of
the exponential is the normalization constant, and the exponential
comes from assuming a Gaussian distribution of kinetic energies for
each momentum component (you can demonstrate that a Maxwellian
distribution is equivalent to a Gaussian in each direction \(p_{x}\), \(p_{y}\),
\(p_{z}\), by going to spherical-polar coordinates in momentum space, thus
introducing a Jacobian for the change of variables, and integrating
over the \(p_{\theta}\), \(p_{\varphi}\) components).
</p>

<p>
From this, we can calculate the pressure of the gas. By definition
this will be isotropic, and so we can imagine to put a "box" with unit
linear size through our gas (the orientation of the walls does not
matter). To determine the gas pressure we want the force exerted by
the gas on the walls. By Newton's third law this is equal to the
change in momentum of each gas particles as they hit the walls. We
will first consider the momentum change for a generic single particle,
and then integrate over the distribution in Eq. \ref{eq:Maxwellian} to
get the whole pressure.
</p>

<p>
Let's call the imaginary wall the xy plane and assume the collisions
to be elastic (because we are considering an ideal gas, by definition
any exchange of energy is negligible). For a generic particle of the
gas, it will collide with the wall at an angle \(\theta \in [0, \pi/2]\) and the
collision will change its momentum from (\(p_{x}\), \(p_{y}\), \(p_{z}\)) to (\(p_{x}\),
\(p_{y}\), \(-p_{z}\)): only the component perpendicular to the wall changes
sign. Thus
</p>

<div class="latex" id="org3b622c3">
\begin{equation}
\Delta p = 2 p \cos(\theta)\  \mathrm{with}\  p=\sqrt{p_{x}^{2} + p_{y}^{2} +p_{z}^{2}}
\end{equation}

</div>

<p>
The time between two collisions of a particle on the same wall is
</p>

<div class="latex" id="orgdf13797">
\begin{equation}
\Delta t = \frac{2L}{v\cos(\theta)} = \frac{2}{v\cos(\theta)} \ \ ,
\end{equation}

</div>

<p>
where we used the \(L=1\) assumption. Thus the force exerted on this
imaginary wall of a unit box is \(F=\Delta p/\Delta t = vp cos^{2}(\theta)\), dividing
by \(L^{2} = 1\) we obtain the contribution to the pressure from one particle
coming from one specific direction &theta; (w.r.t. the wall of the box), and
introducing the distribution of particles in angle and momentum we
have
</p>


<div class="latex" id="orgdb72369">
\begin{equation}
dP = vp\cos^{2}(\theta)n(\theta,p)d\theta dp \ \ ,
\end{equation}

</div>

<p>
But we can assume that the motion of the particles is isotropic
(spherical symmetry), so \(n(\theta,p)d\theta = n(p)sin(\theta)d\theta\), and thus
</p>

<div class="latex" id="orgb6a3ebf">
\begin{equation}\label{eq:P_statistic}
dP = vp\cos^{2}(\theta)n(p)\sin(\theta)d\theta dp \Rightarrow P = \frac{1}{3}\int_{0}^{+\infty} n(p)p v dp \ \ ,
\end{equation}

</div>
<p>
where we integrated over \(\theta\). Combining Eq. \ref{eq:P_statistic} with Eq. \ref{eq:Maxwellian} gives the pressure.
</p>
</div>

<div id="outline-container-org4c955ff" class="outline-4">
<h4 id="org4c955ff"><a href="#org4c955ff">Non-relativistic, classical gas</a></h4>
<div class="outline-text-4" id="text-org4c955ff">
<p>
Let's consider a non-relativistic gas of classical particles (no
quantum effects). Then \(p= mv \Leftrightarrow v=p/m\) (<b>N.B.:</b> we are considering an
ideal gas, so each particle is freely moving, no potential of
interaction!). Carrying out the integral above using the
Maxwell-Boltzmann distribution for \(n(p)\) and \(v=p/m\) gives
</p>

<div class="latex" id="orgc63febc">
\begin{equation}
P = n k_{B} T \ \ .
\end{equation}

</div>
</div>
</div>
