org-content/notes-lecture-EOS1.org
*** Mixture of (non-relativistic, classical) gases
Let's now say that we have multiple gas mixed, for example, a gas of
ions of various species and electrons. Each gas will contribute to the
pressure: $P_{tot} = P_{ion, tot} + P_{e} = \sum_{i} P_{ion, i} + P_{e} = (\sum_{i}n_{i} +n_{e}) k_{B}T$,
where $n_{i}$ is the number density of the ions $i$, which have mass $m_{u} A_{i}$
with $m_{u}$ the /atomic mass unit/:

#+begin_latex
\begin{equation}
m_{u} = 1 / N_{A} \,\mathrm{g} \simeq 1.66 \times 10^{-24} \,\mathrm{g} \ \ .
\end{equation}
#+end_latex

Thus, we can relate the number density of the ions of species i with
the mass density that already appears in the equations we already have
with $n_{i} = X_{i}\rho/(A_{i} m_{u})$. Note that we are implicitly using the fact
that everything has the same T because of the assumption of LTE!

We can re-write the total contribution of the ions defining the
ion /mean molecular weight/ such that $\mu_\mathrm{ion} \times m_{u}$ = "average mass of
ions", that is $\mu_\mathrm{ion} n_\mathrm{ion} = \rho/m_{u}$ or $n_\mathrm{ion} = \sum_{i} n_{i} = \sum_{i} X_{i}\rho/(A_{i}m_{u}) \equiv
\rho/(\mu_\mathrm{ion}m_{u})$ and:

#+begin_latex
\begin{equation}
\frac{1}{\mu_\mathrm{ion}} = \sum_{i}\frac{X_{i}\rho}{A_{i}} \ \ .
\end{equation}
#+end_latex

Similarly, we can define an electron mean molecular weight noticing
that to maintain a total charge of zero per unit volume, since each
ion carries charge $+Z_{i}e$ and each electron as charge $-e$: $(\sum_{i} Z_{i}n_{i} -
n_{e})e = 0$. Thus

#+begin_latex
\begin{equation}
\frac{1}{\mu_\mathrm{e}} = \sum_{i}\frac{Z_{i}X_{i}\rho}{A_{i}} \ \ .
\end{equation}
#+end_latex

and we can define a combined mean molecular weight:

#+begin_latex
\begin{equation}
\frac{1}{\mu} = \frac{1}{\mu_\mathrm{ion}}+\frac{1}{\mu_{e}} \ \ ,
\end{equation}
#+end_latex
So that the total pressure of a mixture of ideal, classical and
non-relativistic gas is

#+begin_latex
\begin{equation}\label{eq:ideal_gas_EOS}
P = \frac{\rho}{\mu m_{u}}k_{B}T
\end{equation}
#+end_latex

The introduction of the /mean molecular weight/ allows us to treat a
mixture of gases (assumed to be in LTE) as a single gas!

*N.B.:* this holds as long as every species satisfies our assumption of
ideal, non-relativistic, classical gas.

*** Physical interpretation of $\mu$
The /mean molecular weight/ we have introduced above may seem a bit
arbitrary, but it has a clear physical interpretation: it is the
average number of particles per unit atomic mass $m_{u}$.

For a fully ionized gas (i.e., where every ion is stripped of /all/ its
electrons):

#+begin_latex
\begin{equation}
\mu = \frac{1}{\sum_{i}X_{i}\left(\frac{Z_{i}+1}{A_{i}}\right)} \ \ ,
\end{equation}
#+end_latex
In fact, for every $i$-th species that corresponds to a fraction $X_{i}$
of the total mass, that is $X_{i}/A_{i}$ in number density, we have $Z_{i}$
electrons plus one nucleus that contribute. This approximation is
usually good in the stellar interior, but as one moves outwards in the
star, $P$ decreases, therefore by Eq. \ref{eq:ideal_gas_EOS}, $T$
decreases, and elements recombine, meaning the term $Z_{i}+1$ is reduced.
This can have important consequences in certain layers of the stars
("partial ionization layers").

We can further simplify the expression for $\mu$ by noting that for
hydrogen $(Z_{i} +1)/A_{i} = 2$ (i.e., hydrogen contributes 2 particles per
unit atomic mass, one proton and one electron), for helium $(Z_{i} +1)/A_{i}
= 3/4$ (we are actually considering only the stable isotope of helium
that contributes 3 particles every 4 atomic mass units, one nucleus
and 2 electrons), and for the vast majority of stable metals $Z_{i} \gg 1$
and $Z_{i} \simeq A_{i}/2$ (i.e., most metals contribute per each $A_{i}$ atomic
mass units roughly $A_{i}/2$ particles which are the electrons that are
typically half as many as the nucleons). Therefore, for fully ionized
gas, we can simplify the mean molecular weight to:

#+begin_latex
\begin{equation}
\mu \simeq \frac{1}{2X + \frac{3Y}{4} + \frac{Z}{2}} \ \ ,
\end{equation}
#+end_latex
where $X$, $Y$, $Z$ are the mass fraction of hydrogen, helium, and the
metallicity, respectively.

** Relation between pressure and internal density

Eq. \ref{eq:P_statistic} can be used to relate $P$ to the internal
energy density of a gas. This can be defined as:

#+begin_latex
\begin{equation}\label{eq:E_statistic}
du_\mathrm{int} = \varepsilon(p)n(p)dp  \ \ ,
\end{equation}
#+end_latex
with \varepsilon(p) the energy per particle.

If the particles in the (ideal) gas are non-relativistic, then
$\varepsilon=p^{2}/2m$, thus in the term $pv$ in Eq. \ref{eq:P_statistic} is $pv = 2\varepsilon$,
and thus:

#+begin_latex
\begin{equation}
P = \frac{2}{3} u_\mathrm{int} \ \ .
\end{equation}
#+end_latex

If instead the gas is ultra-relativistic, then $\varepsilon = pc$ (neglecting the
mass term in the energy since $pc \gg mc^{2}$), and thus:

#+begin_latex
\begin{equation}
P=\frac{u_\mathrm{int}}{3} \ \ .
\end{equation}
#+end_latex

** Can we really use an ideal gas EOS in a plasma?

This is legitimate as long as the interaction energy between the
particles are small compared to their kinetic energy. The dominant
interaction between the particles (ions and electrons) is going to be
through the Coulomb force, leading to energy exchanges of the order of:

#+begin_latex
\begin{equation}
\varepsilon_\mathrm{Coulomb} \simeq \frac{Z^{2}e^{2}}{d} \ \ ,
\end{equation}
#+end_latex

for particles of charge $Ze$ (the ions) and average distance $d \simeq (4\pi
n/3)^{-1/3}$ with $n\simeq\rho/Am_{u}$ number density. We want to compare this with the
kinetic energy, which for point-like particles is $\varepsilon_\mathrm{thermal} = 3k_{b}T/2$.
The ratio of these two is often called the Coulomb parameter
(neglecting constants of order unity):

#+begin_latex
\begin{equation}
\Gamma_{C} = \frac{\varepsilon_\mathrm{Coulomb}}{\varepsilon_\mathrm{thermal}} \simeq \frac{Z^{2}e^{2}}{dk_{B}T} \simeq \frac{(Ze)^{2}}{k_{B}T}\left(\frac{\rho}{Am_{u}}\right)^{1/3} \simeq 2.275\times 10^{5} Z^{2} A^{-1/3}\left(\frac{\rho}{\mathrm{g\ cm^{-3}}}\right)^{1/3 }\left(\frac{T}{\mathrm{K}}\right)^{-1}\ \ .
\end{equation}
#+end_latex
We can assume the ideal gas situation if $\Gamma_{C} \ll 1$, which is the case
for the average $T$ and \rho of the Sun (we will estimate the average
temperature of the Sun in the [[file:notes-lecture-VirTheo.org::+title: 400A - Virial theorem][next lecture]]). We also see that at
progressively lower temperature the Coulomb interaction start to
matter (this is important for the crystallization of WDs for
instance), or at increasingly high densities.

# *** Electron screening

# At sufficiently high densities, the nuclei will tend to attract a
# "cloud" of electrons in their surroundings, even if they are not bound
# to each other forming an ion/atom. This effectively leads to the
# so-called "electron screening", which decreases the effective charge
# felt between nuclei: on the one hand this is a clear deviation from
# the idea of a mixture of ideal gases made of ions and electrons, on
# the other hand, this particular effect helps nuclear reactions occur
# in the core, as we will see later on.

