html-content/notes-lecture-EOS1.html

<div id="outline-container-org3f6ecd3" class="outline-4">
<h4 id="org3f6ecd3"><a href="#org3f6ecd3">Mixture of (non-relativistic, classical) gases</a></h4>
<div class="outline-text-4" id="text-org3f6ecd3">
<p>
Let's now say that we have multiple gas mixed, for example, a gas of
ions of various species and electrons. Each gas will contribute to the
pressure: \(P_{tot} = P_{ion, tot} + P_{e} = \sum_{i} P_{ion, i} + P_{e} = (\sum_{i}n_{i} +n_{e}) k_{B}T\),
where \(n_{i}\) is the number density of the ions \(i\), which have mass \(m_{u} A_{i}\)
with \(m_{u}\) the <i>atomic mass unit</i>:
</p>

<div class="latex" id="org463449b">
\begin{equation}
m_{u} = 1 / N_{A} \,\mathrm{g} \simeq 1.66 \times 10^{-24} \,\mathrm{g} \ \ .
\end{equation}

</div>

<p>
Thus, we can relate the number density of the ions of species i with
the mass density that already appears in the equations we already have
with \(n_{i} = X_{i}\rho/(A_{i} m_{u})\). Note that we are implicitly using the fact
that everything has the same T because of the assumption of LTE!
</p>

<p>
We can re-write the total contribution of the ions defining the
ion <i>mean molecular weight</i> such that \(\mu_\mathrm{ion} \times m_{u}\) = "average mass of
ions", that is \(\mu_\mathrm{ion} n_\mathrm{ion} = \rho/m_{u}\) or \(n_\mathrm{ion} = \sum_{i} n_{i} = \sum_{i} X_{i}\rho/(A_{i}m_{u}) \equiv
\rho/(\mu_\mathrm{ion}m_{u})\) and:
</p>

<div class="latex" id="orgdb8b6c9">
\begin{equation}
\frac{1}{\mu_\mathrm{ion}} = \sum_{i}\frac{X_{i}\rho}{A_{i}} \ \ .
\end{equation}

</div>

<p>
Similarly, we can define an electron mean molecular weight noticing
that to maintain a total charge of zero per unit volume, since each
ion carries charge \(+Z_{i}e\) and each electron as charge \(-e\): \((\sum_{i} Z_{i}n_{i} -
n_{e})e = 0\). Thus
</p>

<div class="latex" id="orge9dc0b3">
\begin{equation}
\frac{1}{\mu_\mathrm{e}} = \sum_{i}\frac{Z_{i}X_{i}\rho}{A_{i}} \ \ .
\end{equation}

</div>

<p>
and we can define a combined mean molecular weight:
</p>

<div class="latex" id="org42a25c9">
\begin{equation}
\frac{1}{\mu} = \frac{1}{\mu_\mathrm{ion}}+\frac{1}{\mu_{e}} \ \ ,
\end{equation}

</div>
<p>
So that the total pressure of a mixture of ideal, classical and
non-relativistic gas is
</p>

<div class="latex" id="org992a75e">
\begin{equation}\label{eq:ideal_gas_EOS}
P = \frac{\rho}{\mu m_{u}}k_{B}T
\end{equation}

</div>

<p>
The introduction of the <i>mean molecular weight</i> allows us to treat a
mixture of gases (assumed to be in LTE) as a single gas!
</p>

<p>
<b>N.B.:</b> this holds as long as every species satisfies our assumption of
ideal, non-relativistic, classical gas.
</p>
</div>
</div>

<div id="outline-container-orgf14b709" class="outline-4">
<h4 id="orgf14b709"><a href="#orgf14b709">Physical interpretation of \(\mu\)</a></h4>
<div class="outline-text-4" id="text-orgf14b709">
<p>
The <i>mean molecular weight</i> we have introduced above may seem a bit
arbitrary, but it has a clear physical interpretation: it is the
average number of particles per unit atomic mass \(m_{u}\).
</p>

<p>
For a fully ionized gas (i.e., where every ion is stripped of <i>all</i> its
electrons):
</p>

<div class="latex" id="org763b52c">
\begin{equation}
\mu = \frac{1}{\sum_{i}X_{i}\left(\frac{Z_{i}+1}{A_{i}}\right)} \ \ ,
\end{equation}

</div>
<p>
In fact, for every $i$-th species that corresponds to a fraction \(X_{i}\)
of the total mass, that is \(X_{i}/A_{i}\) in number density, we have \(Z_{i}\)
electrons plus one nucleus that contribute. This approximation is
usually good in the stellar interior, but as one moves outwards in the
star, \(P\) decreases, therefore by Eq. \ref{eq:ideal_gas_EOS}, \(T\)
decreases, and elements recombine, meaning the term \(Z_{i}+1\) is reduced.
This can have important consequences in certain layers of the stars
("partial ionization layers").
</p>

<p>
We can further simplify the expression for \(\mu\) by noting that for
hydrogen \((Z_{i} +1)/A_{i} = 2\) (i.e., hydrogen contributes 2 particles per
unit atomic mass, one proton and one electron), for helium \((Z_{i} +1)/A_{i}
= 3/4\) (we are actually considering only the stable isotope of helium
that contributes 3 particles every 4 atomic mass units, one nucleus
and 2 electrons), and for the vast majority of stable metals \(Z_{i} \gg 1\)
and \(Z_{i} \simeq A_{i}/2\) (i.e., most metals contribute per each \(A_{i}\) atomic
mass units roughly \(A_{i}/2\) particles which are the electrons that are
typically half as many as the nucleons). Therefore, for fully ionized
gas, we can simplify the mean molecular weight to:
</p>

<div class="latex" id="org0fba8a3">
\begin{equation}
\mu \simeq \frac{1}{2X + \frac{3Y}{4} + \frac{Z}{2}} \ \ ,
\end{equation}

</div>
<p>
where \(X\), \(Y\), \(Z\) are the mass fraction of hydrogen, helium, and the
metallicity, respectively.
</p>
</div>
</div>
</div>

<div id="outline-container-org9aa6cd7" class="outline-3">
<h3 id="org9aa6cd7"><a href="#org9aa6cd7">Relation between pressure and internal density</a></h3>
<div class="outline-text-3" id="text-org9aa6cd7">
<p>
Eq. \ref{eq:P_statistic} can be used to relate \(P\) to the internal
energy density of a gas. This can be defined as:
</p>

<div class="latex" id="org0671c47">
\begin{equation}\label{eq:E_statistic}
du_\mathrm{int} = \varepsilon(p)n(p)dp  \ \ ,
\end{equation}

</div>
<p>
with &epsilon;(p) the energy per particle.
</p>

<p>
If the particles in the (ideal) gas are non-relativistic, then
\(\varepsilon=p^{2}/2m\), thus in the term \(pv\) in Eq. \ref{eq:P_statistic} is \(pv = 2\varepsilon\),
and thus:
</p>

<div class="latex" id="org6304a83">
\begin{equation}
P = \frac{2}{3} u_\mathrm{int} \ \ .
\end{equation}

</div>

<p>
If instead the gas is ultra-relativistic, then \(\varepsilon = pc\) (neglecting the
mass term in the energy since \(pc \gg mc^{2}\)), and thus:
</p>

<div class="latex" id="org74b4c81">
\begin{equation}
P=\frac{u_\mathrm{int}}{3} \ \ .
\end{equation}

</div>
</div>
</div>

<div id="outline-container-org29c8edb" class="outline-3">
<h3 id="org29c8edb"><a href="#org29c8edb">Can we really use an ideal gas EOS in a plasma?</a></h3>
<div class="outline-text-3" id="text-org29c8edb">
<p>
This is legitimate as long as the interaction energy between the
particles are small compared to their kinetic energy. The dominant
interaction between the particles (ions and electrons) is going to be
through the Coulomb force, leading to energy exchanges of the order of:
</p>

<div class="latex" id="org6cdc9fa">
\begin{equation}
\varepsilon_\mathrm{Coulomb} \simeq \frac{Z^{2}e^{2}}{d} \ \ ,
\end{equation}

</div>

<p>
for particles of charge \(Ze\) (the ions) and average distance \(d \simeq (4\pi
n/3)^{-1/3}\) with \(n\simeq\rho/Am_{u}\) number density. We want to compare this with the
kinetic energy, which for point-like particles is \(\varepsilon_\mathrm{thermal} = 3k_{b}T/2\).
The ratio of these two is often called the Coulomb parameter
(neglecting constants of order unity):
</p>

<div class="latex" id="orgbe12163">
\begin{equation}
\Gamma_{C} = \frac{\varepsilon_\mathrm{Coulomb}}{\varepsilon_\mathrm{thermal}} \simeq \frac{Z^{2}e^{2}}{dk_{B}T} \simeq \frac{(Ze)^{2}}{k_{B}T}\left(\frac{\rho}{Am_{u}}\right)^{1/3} \simeq 2.275\times 10^{5} Z^{2} A^{-1/3}\left(\frac{\rho}{\mathrm{g\ cm^{-3}}}\right)^{1/3 }\left(\frac{T}{\mathrm{K}}\right)^{-1}\ \ .
\end{equation}

</div>
<p>
We can assume the ideal gas situation if \(\Gamma_{C} \ll 1\), which is the case
for the average \(T\) and &rho; of the Sun (we will estimate the average
temperature of the Sun in the <a href="notes-lecture-VirTheo.html#orgba10e2d">next lecture</a>). We also see that at
progressively lower temperature the Coulomb interaction start to
matter (this is important for the crystallization of WDs for
instance), or at increasingly high densities.
</p>
</div>
</div>
</div>
