org-content/notes-lecture-EOS1.org
* Homework
- We have discussed that the internal layers of the star are in LTE
  using an argument based on the photons mean free path \ell_{\gamma}.
  Assuming a star of constant density (use the mean density for
  this!), pure hydrogen composition, and that electron scattering is
  the dominant interaction of the photons in the stellar interior so
  \kappa\simeq\kappa_{es}=0.2(1+X), using one-dimensional random-walk arguments,
  estimate:
  1. how many scatterings a photon created in the center of the Sun
     will experience before coming out at the surface?
  2. Knowing that photons travel at the speed of light c and assuming
     scatterings to be instantaneous, what is the photon diffusion
     timescale throughout the star? How does it compare to the
     dynamical timescale?
- Run with =MESA-web= a 0.3M_{\odot} star up to 10^{8} yrs, and plot the
  P(\rho) profile of the star at this age (*Hint*: it may be useful to plot it on
  a log-log plot). Do you think it is possible to find a good
  approximation of this profile with a polytropic relation? Note that
  =MESA-web= does *not* assume a poytropic EOS! As usual, the deliverables
  are the plot, the code used to make it, and a small paragraph of
  text with your answer. *Extra*: you may even try to fit a polytrope
  throughout the star and provide the polytropic index \Gamma.
