html-content/notes-lecture-EOS1.html

<div id="outline-container-orge470e84" class="outline-2">
<h2 id="orge470e84"><a href="#orge470e84">Homework</a></h2>
<div class="outline-text-2" id="text-orge470e84">
<ul class="org-ul">
<li>We have discussed that the internal layers of the star are in LTE
using an argument based on the photons mean free path &ell;<sub>&gamma;</sub>.
Assuming a star of constant density (use the mean density for
this!), pure hydrogen composition, and that electron scattering is
the dominant interaction of the photons in the stellar interior so
&kappa;&cong;&kappa;<sub>es</sub>=0.2(1+X), using one-dimensional random-walk arguments,
estimate:
<ol class="org-ol">
<li>how many scatterings a photon created in the center of the Sun
will experience before coming out at the surface?</li>
<li>Knowing that photons travel at the speed of light c and assuming
scatterings to be instantaneous, what is the photon diffusion
timescale throughout the star? How does it compare to the
dynamical timescale?</li>
</ol></li>
<li>Run with <code>MESA-web</code> a 0.3M<sub>☉</sub> star up to 10<sup>8</sup> yrs, and plot the
P(&rho;) profile of the star at this age (<b>Hint</b>: it may be useful to plot it on
a log-log plot). Do you think it is possible to find a good
approximation of this profile with a polytropic relation? Note that
<code>MESA-web</code> does <b>not</b> assume a poytropic EOS! As usual, the deliverables
are the plot, the code used to make it, and a small paragraph of
text with your answer. <b>Extra</b>: you may even try to fit a polytrope
throughout the star and provide the polytropic index &Gamma;.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">
  <hr>
  <a href="#light-dark-toggle"><i id="light-dark-toggle"><i class="fa-solid fa-circle-half-stroke"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="notes-lecture-HSE.html"><i class="fa-solid fa-arrow-left" style="font-size:16px"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="#top"><i class="fa-solid fa-arrow-up" style="font-size:16px"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="notes-lecture-VirTheo.html"><i class="fa-solid fa-arrow-right" style="font-size:16px"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="https://github.com/mathren/stellar_phys_400A"><i class="fa-brands fa-github" style="font-size:16px"></i></a><hr>
  <br>
  Last updated on 1 February 2025 <br>
  Made with Emacs 28.1 - Org mode 9.5.2
  <br>
</div>
</div>
</body>
</html>
